[
    {
        "_id": "blog-001",
        "title": "Can Textiles Lead The Way During The Pandemic?",
        "date": "2021-07-21",
        "image": "https://i.ibb.co.com/HLc5F16Q/textile.png",
        "description": "The pandemic reshaped global demand and exposed vulnerabilities in supply chains, but it also created opportunities for the textile sector. Manufacturers who rapidly adapted to produce PPE, antimicrobial fabrics, and flexible small-batch production demonstrated how agility and innovation can drive resilience. This article explores how sustainable sourcing, digital ordering, and localized production can position textiles as a leading industry in post-pandemic recovery."
    },
    {
        "_id": "blog-002",
        "title": "Role of Fashion Merchandising in Apparel Industry",
        "date": "2021-07-16",
        "image": "https://i.ibb.co.com/pjdw39d8/Merchantdise.png",
        "description": "Fashion merchandising sits at the intersection of creativity and commerce, translating design ideas into market-ready products. It involves trend forecasting, assortment planning, pricing strategy, and retail placement to ensure the right product reaches the right customer at the right time. Effective merchandising reduces markdowns, improves inventory turns, and strengthens brand positioning in a highly competitive apparel market."
    },
    {
        "_id": "blog-003",
        "title": "One Stop Solution for Textiles Fabrics Materials",
        "date": "2021-07-16",
        "image": "https://i.ibb.co.com/bRJn5M5S/Fabric2.png",
        "description": "A true one-stop textile supplier offers comprehensive material variety, quality assurance, and integrated services from sampling to delivery. By combining dyeing, finishing, printing and technical support under one roof, manufacturers can shorten lead times and maintain consistent quality across production runs. This piece explains the operational benefits and cost efficiencies companies gain by partnering with full-service textile providers."
    }
]